app/views/movies/search.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."title" = $1  [["title", "Sicario"]]
---

    <% db_movie = Movie.where(title:entry["title"]) %>