app/views/movies/show.html.erb

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
  <div class="item3">Released : <%= @movie.year %></div>
  <div class="item4"><h4><% if @movie.director.present? %>