app/views/directors/show.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."director_id" = $1  [["director_id", 10]]
---
  <li>Directed :
    <% @director.movies.each do |movie| %>