app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" ORDER BY "movies"."id" DESC LIMIT $1  [["LIMIT", 5]]
---
  def reviews
    @movies = Movie.last(5).reverse

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find params[:id]

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 45]]
---
  def destroy
    movie = Movie.find params[:id]
    movie.destroy

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
UPDATE "movies" SET "rating" = $1, "review" = $2, "updated_at" = $3 WHERE "movies"."id" = $4  [["rating", 5], ["review", ""], ["updated_at", "2018-07-19 21:46:05.062414"], ["id", 32]]
---
  def update
    movie = Movie.find params[:id]
    movie.update movie_params

SELECT "directors".* FROM "directors" WHERE "directors"."name" = $1  [["name", "Kevin Scott Frakes"]]
SELECT "directors".* FROM "directors" WHERE "directors"."name" = $1  [["name", "John McTiernan"]]
INSERT INTO "directors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Kevin Scott Frakes"], ["created_at", "2018-07-20 01:57:44.647456"], ["updated_at", "2018-07-20 01:57:44.647456"]]
---
def fetch
  movie_id = params[:id]

  movie_url = "#{BASE_MOVIE_URL}#{movie_id}?api_key=#{API_KEY}&language=en-US"
  tmdb_response_movie = HTTParty.get movie_url

  credits_url = "#{BASE_MOVIE_URL}#{movie_id}/credits?api_key=#{API_KEY}&language=en-US"
  tmdb_response_credits = HTTParty.get credits_url

# Directors!! do we need to add the director for this movie
# or use an exisiting one
  director_id = tmdb_response_credits["crew"].first["id"]
  director_name = tmdb_response_credits["crew"].first["name"]
  local_director = Director.where(name: director_name)
  if local_director.present?
    local_director_id = local_director.first["id"]
  else
    director_url = "#{BASE_PERSON_URL}#{director_id}?api_key=#{API_KEY}&language=en-US"
    tmdb_response_director = HTTParty.get director_url
    director = Director.new
    director.name = tmdb_response_director["name"]
    if tmdb_response_director["profile_path"]
      director.image = "#{BASE_IMAGE_URL}w300" + tmdb_response_director["profile_path"]
    end
    director.save

INSERT INTO "movies" ("image", "title", "plot", "director_id", "created_at", "updated_at", "year") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  movie.year = tmdb_response_movie["release_date"][0,4]
  movie.plot = tmdb_response_movie["overview"]
  movie.director_id = local_director_id
  movie.save